import React from "react";
import "./Profiles.css";
import kz from "../../../assets/kundz.png";
const profiles = [
  {
    href: "https://www.linkedin.com/in/%D0%BA%D1%83%D0%BD%D0%B4%D1%8B%D0%B7-%D0%BC%D0%B0%D0%BA%D1%81%D1%83%D1%82%D0%BE%D0%B2%D0%B0-628746152",
    name: "Максутова Кундыз Мухтаровна",

    experience:
      "Диссертациның тақырыбы: «Технологии обработки знаний в области информатики на казахском языке»",
    src: kz,
  },
];
const Profiles = () => {
  return (
    <div className="profile-container">
      {profiles.map((profile, index) => (
        <a href={profile.href} className="aa">
          <div key={index} className="profile-card">
            <div className="profile-image">
              <img src={profile.src} alt={profile.name} />
            </div>
            <div className="profile-info">
              <div className="overlay-img">
                <h2>{profile.name}</h2>
                <h3>{profile.title}</h3>
              </div>
              <p>
                {profile.experience}
                <br />
                Ақпараттық коммуникациялық технологиялар
                <br />
                <br />
                Нұр-Сұлтан қ.
                <br />
                тел. +7 702 511 85 90
                <br />
                Е-mail: kundyzym@bk.ru
                <br />
                <br />
                <b>Басылымдар және презентациялар:</b>
                <ul>
                  <ol>
                    1.Приближенно – аналитическое и численное решение
                    термонапряженного состояния стержня переменного сечения
                    Ө.А.Байқоңыров атындағы Жезқазған университетінің ХАБАРШЫСЫ
                    №1, 2013 ІSSN 1680-9262{" "}
                  </ol>
                  <ol>
                    2. Электронды оқыту – колледждің білім беру жүйесінде
                    Алматы: №3(05) 2014 Колледж: кәсіби білім беру
                  </ol>
                  <ol>
                    3. Электрондық құжат айналымды ұйымдастыру Алматы: №1(09)
                    2015 Колледж: кәсіби білім беру
                  </ol>
                  <ol>
                    4. Информатика пәнінен электронды оқулық жасау және
                    пайдалану технологиясы Алматы: №1(09) 2015 Колледж: кәсіби
                    білім беру
                  </ol>
                  <ol>
                    5.Ақпараттық-коммуникациялық технологияларды оқу үрдісінде
                    қолдану ІІ Халықаралық ғылыми-тәжірибелік конференция
                  </ol>
                  <ol>
                    6. ICT ONolNE LEARNING жобасы «ЗАМАНАУИ ИНЖЕНЕРЛІК
                    ИННОВАЦИЯЛАР МЕН ТЕХНОЛОГИЯЛАР» атты онлайн халықаралық
                    ғылыми- тәжірибелік конференция
                  </ol>
                  <ol>
                    7. Өндірістегі ақпараттық қауіпсіздіктің ерекшеліктері
                    «ИННОВАЦИЯЛАР ЖӘНЕ ҚАЗІРГІ ЗАМАНҒЫ ҒЫЛЫМДЫ ДАМЫТУ
                    МӘСЕЛЕЛЕРІ» Халықаралық ғылыми-тәжірибелік конференциясы{" "}
                  </ol>
                  <ol>
                    8. Государственная программа «Цифровой Казахстан -2020»
                    Общество. №2(13) 2019 ІSSN 2310-9319 г.Чебоксары
                  </ol>
                </ul>
              </p>
            </div>
          </div>
        </a>
      ))}
    </div>
  );
};

export default Profiles;
