const kaz2 = [
  {
    question: "Цикл дегеніміз не?",
    answers: [
      {
        text: "Бір реттік оқиға.",
        correct: "false",
      },
      {
        text: "Шарт орындалған жағдайда ғана орындалатын процесс.",
        correct: "false",
      },
      {
        text: "Үздіксіз қайталанатын оқиғалар жиынтығы.",
        correct: "true",
      },
      {
        text: "Нұсқаулардың бір рет орындалуы.",
        correct: "false",
      },
    ],
  },
  {
    question: "Бағдарламалаудағы цикл түрлері қандай?",
    answers: [
      {
        text: "Кезектес және шартты.",
        correct: "false",
      },
      {
        text: "for және while.",
        correct: "true",
      },
      {
        text: "if және else.",
        correct: "false",
      },
      {
        text: "try және except.",
        correct: "false",
      },
    ],
  },
  {
    question: "'for' параметрі бар цикл дегеніміз не?",
    answers: [
      {
        text: "Шексіз орындалатын шартты цикл.",
        correct: "false",
      },
      {
        text: "Белгілі сандағы қайталаулары бар арифметикалық цикл.",
        correct: "true",
      },
      {
        text: "Тек бір рет орындалатын цикл.",
        correct: "false",
      },
      {
        text: "Рекурсивті функция шақыруы.",
        correct: "false",
      },
    ],
  },
  {
    question: "'while' параметрі бар цикл дегеніміз не?",
    answers: [
      {
        text: "Орындау санын анықтау үшін санауышты пайдаланатын цикл.",
        correct: "false",
      },
      {
        text: "Белгісіз сандағы қайталаулары бар қадамдық (итерациялық) цикл.",
        correct: "true",
      },
      {
        text: "Кем дегенде бір рет орындалатын цикл.",
        correct: "false",
      },
      {
        text: "Пайдаланушының енгізуіне байланысты цикл.",
        correct: "false",
      },
    ],
  },
  {
    question:
      "Параметрі бар циклдің жұмысын ұйымдастыру үшін не қолдану керек?",
    answers: [
      {
        text: "Шарты бар while операторы.",
        correct: "false",
      },
      {
        text: "Логикалық шарты бар if мәлімдемесі.",
        correct: "false",
      },
      {
        text: "range() функциясымен бірге for операторы.",
        correct: "true",
      },
      {
        text: "Пост-шарты бар do-while операторы.",
        correct: "false",
      },
    ],
  },
  {
    question: "Шексіз цикл дегеніміз не?",
    answers: [
      {
        text: "Ұзақ, бірақ шектеулі санда орындалатын цикл.",
        correct: "false",
      },
      {
        text: "Бағдарламалау қателіктерінен туындаған жағдай.",
        correct: "true",
      },
      {
        text: "Әрдайым кем дегенде он рет орындалатын цикл.",
        correct: "false",
      },
      {
        text: "Барлық мүмкін бағдарламалық күйлерді қамтитын цикл.",
        correct: "false",
      },
    ],
  },
  {
    question: "Ішкі циклдер дегеніміз не?",
    answers: [
      {
        text: "Өзін-өзі рекурсивті түрде шақыратын функция.",
        correct: "false",
      },
      {
        text: "Параллель орындалатын циклдер.",
        correct: "false",
      },
      {
        text: "Бірінің ішінде басқасы пайдаланылатын бірнеше қарапайым циклдер.",
        correct: "true",
      },
      {
        text: "Функция шақыруымен бөлінген циклдер.",
        correct: "false",
      },
    ],
  },
  {
    question: "Массив дегеніміз не?",
    answers: [
      {
        text: "Әртүрлі типтегі объектілер жиынтығы.",
        correct: "false",
      },
      {
        text: "Біртұтас бүтінді құрайтын бірдей объектілер немесе объектілер жиынтығының жиынтығы.",
        correct: "true",
      },
      {
        text: "Шексіз өсе алатын динамикалық коллекция.",
        correct: "false",
      },
      {
        text: "Элементтерді иерархиялық тәртіппен ұйымдастыратын деректер құрылымы.",
        correct: "false",
      },
    ],
  },
  {
    question: "Бір өлшемді массив дегеніміз не?",
    answers: [
      {
        text: "Массивтер тізімі.",
        correct: "false",
      },
      {
        text: "Бір атпен біріктірілген бірдей типтегі элементтердің белгілі бір саны, әр элементтің өз нөмірі бар.",
        correct: "true",
      },
      {
        text: "Барлық бағытта кеңейе алатын массив.",
        correct: "false",
      },
      {
        text: "Әртүрлі деректер типтерінің элементтері бар деректер құрылымы.",
        correct: "false",
      },
    ],
  },
  {
    question: "Массивтердің қандай түрлері бар?",
    answers: [
      {
        text: "Тікелей және дөңгелек.",
        correct: "false",
      },
      {
        text: "Бір өлшемді, екі өлшемді және көп өлшемді.",
        correct: "true",
      },
      {
        text: "Қоғамдық және жеке.",
        correct: "false",
      },
      {
        text: "Статикалық және динамикалық.",
        correct: "false",
      },
    ],
  },
];

export default kaz2;
