const kaz3 = [
  {
    question: "Белгілік операциялардың неше тобы бар?",
    answers: [
      {
        text: "Бір топ.",
        correct: "false",
      },
      {
        text: "Екі топ: жинақтау операциялары және бөлу операциялары.",
        correct: "true",
      },
      {
        text: "Үш топ.",
        correct: "false",
      },
      {
        text: "Төрт топ.",
        correct: "false",
      },
    ],
  },
  {
    question:
      "Белгілік мәндердегі итерация операциясын анықтау үшін қандай операциялар қолданылады?",
    answers: [
      {
        text: "Қосу және азайту операциялары.",
        correct: "false",
      },
      {
        text: "Көбейту және бөлу операциялары.",
        correct: "false",
      },
      {
        text: "Конкатенация және дизъюнкция операциялары арқылы анықталады.",
        correct: "true",
      },
      {
        text: "Салыстыру және теңдік операциялары.",
        correct: "false",
      },
    ],
  },
  {
    question: "Бос тізім дегеніміз не?",
    answers: [
      {
        text: "Бір бос элементі бар тізім.",
        correct: "false",
      },
      {
        text: "Барлық элементтері null болатын тізім.",
        correct: "false",
      },
      {
        text: "Ештеңе қамтымайды.",
        correct: "true",
      },
      {
        text: "Нөл мәндерімен толтырылған тізім.",
        correct: "false",
      },
    ],
  },
  {
    question: "Тізімде бөлу операциясы дегеніміз не?",
    answers: [
      {
        text: "Екі тізімді біріктіретін операция.",
        correct: "false",
      },
      {
        text: "Белгілі бір шарт бойынша берілген белгілік тізбектен символды немесе бұл тізбектің бір бөлігін алып тастауға мүмкіндік беретін қулық.",
        correct: "true",
      },
      {
        text: "Тізім элементтерін кездейсоқ араластыру операциясы.",
        correct: "false",
      },
      {
        text: "Тізімде элемент табу әдісі.",
        correct: "false",
      },
    ],
  },
  {
    question:
      "Бөлу операцияларының ең қарапайымының атауы мен анықтамасы қандай?",
    answers: [
      {
        text: "Бөлу операцияларының ең қарапайымы - белгілі орнынан бастап белгілі сандағы таңбаларды жою операциясы.",
        correct: "true",
      },
      {
        text: "Тізбекте нөлге бөлу.",
        correct: "false",
      },
      {
        text: "Тізбекті тең бөліктерге бөлу.",
        correct: "false",
      },
      {
        text: "Тізбектегі элементтердің ретін кері қайтару.",
        correct: "false",
      },
    ],
  },
  {
    question: "Жинақтау операцияларының тәртібі қандай?",
    answers: [
      {
        text: "Бірінші, конкатенация операциясы -•; екінші, итерация операциясы -*; үшінші, дизъюнкция операциясы -|.",
        correct: "false",
      },
      {
        text: "Бірінші, дизъюнкция операциясы -|; екінші, конкатенация операциясы -•; үшінші, итерация операциясы -*.",
        correct: "false",
      },
      {
        text: "Бірінші, итерация операциясы -*; екінші, конкатенация операциясы -•; үшінші, дизъюнкция операциясы -|.",
        correct: "true",
      },
      {
        text: "Операциялардың кездейсоқ тәртібі.",
        correct: "false",
      },
    ],
  },
  {
    question: "Логикалық көлем дегеніміз не?",
    answers: [
      {
        text: "Логикалық жүйедегі өлшеу.",
        correct: "false",
      },
      {
        text: "Логикалық мәндерден тұратын мәндер.",
        correct: "true",
      },
      {
        text: "Бағдарламалаудағы айнымалы түрі.",
        correct: "false",
      },
      {
        text: "Логикалық нәтижелер қайтаратын функция.",
        correct: "false",
      },
    ],
  },
  {
    question: "Логикалық көлемді қандай мәндер анықтайды?",
    answers: [
      {
        text: '"Жоғары" және "Төмен".',
        correct: "false",
      },
      {
        text: '"Оң" және "Теріс".',
        correct: "false",
      },
      {
        text: '"Қосулы" және "Өшірілген".',
        correct: "false",
      },
      {
        text: '"True" және "False".',
        correct: "true",
      },
    ],
  },
  {
    question: "Буль мәндері қалай беріледі?",
    answers: [
      {
        text: '"True - иә, 1, +; False - жоқ, 0, -"',
        correct: "true",
      },
      {
        text: '"True - жоғары, төмен; False - солға, оңға"',
        correct: "false",
      },
      {
        text: '"True - алға; False - артқа"',
        correct: "false",
      },
      {
        text: '"True - ашу; False - жабу"',
        correct: "false",
      },
    ],
  },
  {
    question: "Логикалық операциялардың қандай түрлері бар?",
    answers: [
      {
        text: '"Көбейту", "Бөлу", "Азайту" техникалары.',
        correct: "false",
      },
      {
        text: '"Үлкейту", "Кішірейту", "Кері айналдыру" әдістері.',
        correct: "false",
      },
      {
        text: '"not", "and", "or" техникалары.',
        correct: "true",
      },
      {
        text: '"Бастау", "Тоқтату", "Үзіліс" процестері.',
        correct: "false",
      },
    ],
  },
];

export default kaz3;
