const rus1 = [
  {
    question: "Что такое информация?",
    answers: [
      {
        text: "Данные, обработанные случайным образом.",
        correct: "false",
      },
      {
        text: "Факт о конкретном объекте, передаваемый в форме символа и сигнала.",
        correct: "true",
      },
      {
        text: "Произвольный набор несвязанных данных.",
        correct: "false",
      },
      {
        text: "Личные мнения о событии.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое сообщение?",
    answers: [
      {
        text: "Запрос на информацию.",
        correct: "false",
      },
      {
        text: "Любые случайные данные.",
        correct: "false",
      },
      {
        text: "Форма информации.",
        correct: "true",
      },
      {
        text: "Устный вопрос.",
        correct: "false",
      },
    ],
  },
  {
    question: "В какой форме может передаваться сообщение?",
    answers: [
      {
        text: "Только по электронным средствам.",
        correct: "false",
      },
      {
        text: "Через зрение, слух, вкус, обоняние и осязание.",
        correct: "true",
      },
      {
        text: "Исключительно через письменный текст.",
        correct: "false",
      },
      {
        text: "Через цифровые сигналы.",
        correct: "false",
      },
    ],
  },
  {
    question: "Какие существуют виды языков коммуникации?",
    answers: [
      {
        text: "Коды и шифры.",
        correct: "false",
      },
      {
        text: "Естественные языки (казахский, русский, английский и т.д.), математический язык, мелодический язык, язык жестов.",
        correct: "true",
      },
      {
        text: "Только языки программирования.",
        correct: "false",
      },
      {
        text: "Лингвистические и нелингвистические формы.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое представление информации в виде текста?",
    answers: [
      {
        text: "Письмо, включающее только цифровые форматы.",
        correct: "false",
      },
      {
        text: "Устные презентации.",
        correct: "false",
      },
      {
        text: "Передача в виде буквы, символа, знака.",
        correct: "true",
      },
      {
        text: "Графические интерфейсы.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое представление информации в числовом виде?",
    answers: [
      {
        text: "Только визуальные данные.",
        correct: "false",
      },
      {
        text: "Передача в виде математического выражения, состоящего из числа и операции.",
        correct: "true",
      },
      {
        text: "Аудиозаписи чисел.",
        correct: "false",
      },
      {
        text: "Только статистический анализ.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое графическое представление информации?",
    answers: [
      {
        text: "Передача через жесты.",
        correct: "false",
      },
      {
        text: "Передача в виде текста.",
        correct: "false",
      },
      {
        text: "Использование двоичного кода.",
        correct: "false",
      },
      {
        text: "Передача в виде изображения, рисунка, графика.",
        correct: "true",
      },
    ],
  },
  {
    question: "Что такое представление информации в виде звука?",
    answers: [
      {
        text: "Передача в виде устной речи, звука, звукового символа.",
        correct: "true",
      },
      {
        text: "Письменные документы.",
        correct: "false",
      },
      {
        text: "Числовые данные.",
        correct: "false",
      },
      {
        text: "Немые фильмы.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое представление информации в виде видеоинформации?",
    answers: [
      {
        text: "Статичные изображения.",
        correct: "false",
      },
      {
        text: "Аудиозаписи.",
        correct: "false",
      },
      {
        text: "Передача в виде движущихся изображений.",
        correct: "true",
      },
      {
        text: "Текстовые данные.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое идентификатор?",
    answers: [
      {
        text: "Длинное описание, включающее специальные символы.",
        correct: "false",
      },
      {
        text: "Последовательность с ограниченной длиной, начинающаяся с буквы и состоящая из букв и цифр.",
        correct: "true",
      },
      {
        text: "Любая случайная строка символов.",
        correct: "false",
      },
      {
        text: "Числовой код без букв.",
        correct: "false",
      },
    ],
  },
];

export default rus1;
