const rus2 = [
  {
    question: "Что такое цикл?",
    answers: [
      {
        text: "Разовое событие.",
        correct: "false",
      },
      {
        text: "Процесс, выполняющийся только при выполнении условия.",
        correct: "false",
      },
      {
        text: "Набор постоянно повторяющихся событий.",
        correct: "true",
      },
      {
        text: "Однократное выполнение инструкций.",
        correct: "false",
      },
    ],
  },
  {
    question: "Какие типы циклов существуют в программировании?",
    answers: [
      {
        text: "Последовательные и условные.",
        correct: "false",
      },
      {
        text: "for и while.",
        correct: "true",
      },
      {
        text: "if и else.",
        correct: "false",
      },
      {
        text: "try и except.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое цикл с параметром 'for'?",
    answers: [
      {
        text: "Условный цикл, выполняющийся бесконечно.",
        correct: "false",
      },
      {
        text: "Арифметический цикл с известным количеством повторений.",
        correct: "true",
      },
      {
        text: "Цикл, выполняющийся только один раз.",
        correct: "false",
      },
      {
        text: "Рекурсивный вызов функции.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое цикл с параметром 'while'?",
    answers: [
      {
        text: "Цикл, использующий счетчик для определения количества выполнений.",
        correct: "false",
      },
      {
        text: "Пошаговый (итерационный) цикл с неизвестным количеством повторений.",
        correct: "true",
      },
      {
        text: "Цикл, выполняющийся как минимум один раз.",
        correct: "false",
      },
      {
        text: "Цикл, зависящий от ввода пользователя.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что использовать для организации работы цикла с параметром?",
    answers: [
      {
        text: "Оператор while с условием.",
        correct: "false",
      },
      {
        text: "Оператор if с логическим условием.",
        correct: "false",
      },
      {
        text: "Оператор for вместе с функцией range().",
        correct: "true",
      },
      {
        text: "Оператор do-while с пост-условием.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое бесконечный цикл?",
    answers: [
      {
        text: "Цикл, выполняющийся большое, но конечное количество раз.",
        correct: "false",
      },
      {
        text: "Случай, вызванный ошибками программирования.",
        correct: "true",
      },
      {
        text: "Цикл, всегда выполняющийся по крайней мере десять раз.",
        correct: "false",
      },
      {
        text: "Цикл, включающий все возможные состояния программы.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое вложенные циклы?",
    answers: [
      {
        text: "Функция, вызывающая сама себя рекурсивно.",
        correct: "false",
      },
      {
        text: "Циклы, выполняющиеся параллельно.",
        correct: "false",
      },
      {
        text: "Несколько простых циклов, один из которых используется внутри другого.",
        correct: "true",
      },
      {
        text: "Циклы, разделенные вызовом функции.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое массив?",
    answers: [
      {
        text: "Коллекция различных типов объектов.",
        correct: "false",
      },
      {
        text: "Совокупность набора однородных объектов или объектов, составляющих единое целое.",
        correct: "true",
      },
      {
        text: "Динамическая коллекция, способная бесконечно расти.",
        correct: "false",
      },
      {
        text: "Структура данных, организующая элементы в иерархическом порядке.",
        correct: "false",
      },
    ],
  },
  {
    question: "Что такое одномерный массив?",
    answers: [
      {
        text: "Список массивов.",
        correct: "false",
      },
      {
        text: "Фиксированное количество элементов одного типа, объединенных общим названием, где каждый элемент имеет свой номер.",
        correct: "true",
      },
      {
        text: "Массив, который может расширяться во всех направлениях.",
        correct: "false",
      },
      {
        text: "Структура данных с элементами разных типов данных.",
        correct: "false",
      },
    ],
  },
  {
    question: "Какие типы массивов существуют?",
    answers: [
      {
        text: "Линейные и круговые.",
        correct: "false",
      },
      {
        text: "Одномерные, двумерные и многомерные.",
        correct: "true",
      },
      {
        text: "Публичные и приватные.",
        correct: "false",
      },
      {
        text: "Статичные и динамические.",
        correct: "false",
      },
    ],
  },
];

export default rus2;
